{"pageProps":{"metadata":{"path":"content/post/2013-02-03-1gam-february-game-design.mdx","title":"#1GAM February: game design","date":"2013-02-03T09:30:37.000Z","categories":["Games development"],"series":null,"description":null,"slug":"1gam-february-game-design","readingTime":"3 min read","draft":false,"disableComments":false,"keywords":[],"banner":null},"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    a: \"a\",\n    h3: \"h3\",\n    blockquote: \"blockquote\",\n    img: \"img\",\n    em: \"em\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsxs(_components.p, {\n      children: [\"It's February already! What kind of madness is this? Anyhow, that means it's time to start working on this month's entry for \", _jsx(_components.a, {\n        href: \"http://www.onegameamonth.com/\",\n        children: \"One Game A Month\"\n      }), \" without further ado. This time I promise not to shamelessly make a port of an existing game and go for a brand new project instead. Shall this initial design article serve as the compromise I\\\"m making to see this game to completion.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I believe the following game concept to be simple enough for it to be achievable within a short month like February. Understandably, mechanics are very likely to change in case they don't work as initially thought. However I've tried to keep the idea to it's bare minimum. Also, additional features will be included if there's a necessity and enough time for them.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Concept\"\n    }), \"\\n\", _jsxs(_components.blockquote, {\n      children: [\"\\n\", _jsx(_components.p, {\n        children: \"The humans have invaded the planet you call home! All of a sudden there are all these conquest hungry astronauts wandering around. You must take your recon spaceship and abduct them all before it's too late!\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.img, {\n      src: \"/img/wp/design-anotated.png\",\n      alt: \"design-anotated.png\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"That's right, you control an alien in a small spaceship who must abduct every astronaut in each level in the minimum amount of time possible. In order to do so, you must position the ship over them for a certain amount of time, while the alien halo drags them up. Beware the rocky environment, you don't want to crash in the middle of the mission!\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Level design would start quite simple with linear levels that test the player's skill controlling the spaceship. However, as the game progresses, things might get complicated. What seems to be a linear level could actually be some sort of maze with hidden astronauts requiring exploration.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Controls\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The player uses touch controls to pilot the spaceship across the level. Rather than using an unpopular virtual joystick, he's presented area controls. The steering force applied to the spaceship will be different depending on the touch position: up, left or right. It's worth mentioning that by touching the intersections, the player can make the ship ascend whilst moving towards a side.\"\n    }), \"\\n\", _jsx(_components.img, {\n      src: \"/img/wp/design-controls.png\",\n      alt: \"design-controls.png\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Piloting the spaceship has the additional difficulty of having to take into account inertia. If we let it descend for a while, it\\\"ll be quite hard to regain height. On the contrary, if we ascend too much, we\\\"ll inevitably crash as well.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Visuals\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"As explained in \", _jsx(_components.a, {\n        href: \"/general/2d-character-creation-and-animation-for-dummies/\",\n        children: _jsx(_components.em, {\n          children: \"\\\"2D character creation and animation… For dummies\\\"\"\n        })\n      }), \", my lack of skill kind of forces me to go for a friendly cartoon style. No worries, that's fine because it matches the gameplay. It's clearly a casual arcade game with funny characters, so some colorful vector art will come very in handy.\"]\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Development\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"LibGDX will be the framework of choice and I\\\"ll try to keep the code as cross platform compatible as possible with the aim of targeting desktop, Android and HTML5. I\\\"ll be regularly posting updates!\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","scope":{}},"series":null},"__N_SSG":true}