{"pageProps":{"metadata":{"path":"content/post/2022-03-14-help-engineers-understand-the-why.mdx","title":"Help Engineers understand the Why","date":"2022-03-14T00:00:00.000Z","categories":["Leadership"],"series":null,"description":"Understanding the why is essential to the success of a project and the team's performance. A group of people who don't understand users or their problems cannot build a high-quality product. Here are a few practices Engineering Managers can put in place to help their teams understand their users better.","slug":"help-engineers-understand-the-why","readingTime":"5 min read","draft":false,"disableComments":false,"keywords":["product development","engineering management","leadership","user interviews","design sprints","dogfooding","backlog refinement","ideation session","product support","user stories"]},"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    img: \"img\",\n    p: \"p\",\n    em: \"em\",\n    blockquote: \"blockquote\",\n    h3: \"h3\",\n    a: \"a\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.img, {\n      src: \"/img/understand-the-why.webp\",\n      alt: \"team building a wooden house\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Every engineer in the team must understand the \", _jsx(_components.em, {\n        children: \"why\"\n      }), \".\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Can everyone confidently answer the question:\"\n    }), \"\\n\", _jsxs(_components.blockquote, {\n      children: [\"\\n\", _jsx(_components.p, {\n        children: \"What problem are we trying to solve with this user story?\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Understanding the \", _jsx(_components.em, {\n        children: \"why\"\n      }), \" is essential to the success of a project and the team's performance. A group of people who don't understand users or their problems cannot build a high-quality product.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Sure, you have well-specified epics and user stories. Still, during delivery, the team will have to make dozens of decisions that are not detailed in the ticket. There are two options. Either delivery grinds to a halt, with engineers constantly asking the Designer/PM. Or they make the decisions themselves. To make the right decisions, everyone needs to understand users, the problem, and the solution.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Everyone needs to understand the \", _jsx(_components.em, {\n        children: \"why\"\n      }), \".\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Many organizations struggle with this. Engineers focus on closing the next ticket in time for sprint review, and PMs are frustrated when features suffer delays because they were subpar.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"As an engineering leader, the bad news is that you are responsible for the situation. The good news is that you can turn the ship around.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"🐶 Dog-food the product\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"What easier way to understand the product better than to use it every day?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Well... None.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Admittedly, some organizations have it easier than others. Engineers at \", _jsx(_components.a, {\n        href: \"https://honeycomb.io/\",\n        children: \"Honeycomb\"\n      }), \" use their own product to observe Honeycomb. If your product doesn't lend itself naturally to be used by engineers, there are still things you can do.\"]\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"At \", _jsx(_components.a, {\n        href: \"https://www.plot.co/\",\n        children: \"Plot\"\n      }), \", we build a tool to help you create learning experiences like the world's best learning designer. We're running a challenge where we will all design a course using our tool. Not only will everyone familiarize themselves with the experience of using the product, but we will also collect loads of valuable feedback.\"]\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"🧪 Engineers join UX interviews\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Engineers who talk to users are bound to get to know them better. They can read written feedback, but there's nothing like talking to them face to face.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"You can suggest they join your team's Designer on the next series of user interviews that validate the solution they will work on next. Start with Engineers shadowing, so they become comfortable. Perhaps you'll get a few individuals interested in conducting interviews themselves!\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"👌 The team refines together\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Many teams do not refine user stories together. I am shocked at the number of instances when just the Engineering Manager, Product Manager, and Designer discuss the backlog. The Engineering Manager breaks down stories into tasks and assigns them to individuals in the team.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I cannot state how extremely damaging that is.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Firstly, Engineers only receive a piece of the puzzle, making it impossible to see the bigger picture. Secondly, they never get the chance to break stories into smaller chunks, missing out on developing a crucial skill.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Refining together is a great way to share knowledge about the system, where the pitfalls and the opportunities are.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"👨‍🎨 Design sprints & ideation sessions\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Having Engineers and other roles participate in design sprints or ideation sessions before a solution is presented to them is fantastic. Instead of thinking about the solution at hand, everyone is now thinking about the actual problem or frictions users face.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"There are a couple of bonuses. One is that Engineers feel more ownership over what they build. The other one is that Engineers might identify great solutions a Designer or PM thought to be technically infeasible. Yet another classic example of why diverse teams build better products.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"💬 Everyone does support!\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It's typical of early-stage startups for everyone to help out with the help desk rotation. The Product Support team may not even exist yet! However, this normally stops the second the Support team assembles.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"A day where the Product Development team helps with Product Support will be a true eye-opener. There is nothing like seeing raw user frustration first-hand. It puts the roadmap into perspective.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"👩‍💻 Make Product part of the JD and interview process\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If your interview process focuses exclusively on technical knowledge, you may attract Engineers who are not interested in understanding users.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Think about the questions and conversations you may have to understand better how candidates think about user problems and solutions.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"⏳ Make time for it\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Of course, you cannot just add new responsibilities to your team and expect nothing else to change. It's an investment. The team may move slightly more slowly initially to increase quality and velocity later.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"🙌 Do you have other practices or techniques? Please do let me know!\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","scope":{}},"series":null},"__N_SSG":true}