{"pageProps":{"metadata":{"path":"content/post/2022-08-02-7-ways-make-performance-reviews-painless-and-fair.mdx","title":"7 ways to make performance reviews painless and fair","date":"2022-08-02T00:00:00.000Z","categories":["Leadership"],"series":null,"description":"Performance reviews are typical in larger organisations. Reports get anxious about a bad review or a pay rise below their expectations. Managers feel the process is cumbersome, wasteful and are concerned they are not being fair with all team members. In this article, I go through 7 tips to make performance reviews painless and fair for everybody involved.","slug":"7-ways-to-make-performance-reviews-painless-and-fair","readingTime":"6 min read","draft":false,"disableComments":false,"keywords":["performance review","performance evaluation","yearly review","quarterly review","expectations","performance","promotion","pay rise","career development","trust","transparency","inclusion","diversity"],"banner":null},"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    img: \"img\",\n    p: \"p\",\n    h2: \"h2\",\n    a: \"a\",\n    ul: \"ul\",\n    li: \"li\",\n    ol: \"ol\",\n    em: \"em\",\n    code: \"code\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.img, {\n      src: \"/img/woman-leaves-feedback.jpg\",\n      alt: \"Woman rates experience on a panel as she leaves\",\n      title: \"By Celpax on [Unsplash](https://unsplash.com/photos/1Lf5Adh9SCg)\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Periodical performance reviews are typical in medium and larger organisations. Whether quarterly or yearly, it's interesting to see reports and managers universally dread them. Reports get anxious about a bad review or a pay rise below their expectations. At the same time, managers feel the process is cumbersome, wasteful and are concerned they are not being fair with all team members.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Luckily, it doesn't have to be like that at all. Performance reviews, when done well, can provide perspective, and clarity, build trust and help folks progress in their careers. In this article, I go through 7 tips to make performance reviews painless and fair for everybody involved.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"😱 1. Give frequent feedback to avoid surprises\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If you were to take away one thing only from this article, please let it be this one. As a manager, it is entirely your fault whenever someone is genuinely surprised with the feedback they receive during a performance review.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"You can avoid this by having regular 1-1s where you set expectations, jointly create goals and share feedback. Giving feedback can sometimes be challenging, especially when someone is not performing. However, you must remember that you are failing the individual and the entire team if you don't. The individual does not get the input they need to improve. They may end up being let go without having received proper support. At the same time, you risk alienating the team if you let poor performance go unaddressed. Giving feedback is the kind thing to do. If you need a few pointers, read \", _jsx(_components.a, {\n        href: \"https://www.radicalcandor.com/\",\n        children: \"Radical Candor\"\n      }), \".\"]\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"🎯 2. Make the goal of the review clear\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Before the review process begins, you should ensure everyone understands the goal of performance evaluations in your company's context. Most of the time, it tends to be along the lines of:\"\n    }), \"\\n\", _jsxs(_components.ul, {\n      children: [\"\\n\", _jsx(_components.li, {\n        children: \"Summary of performance and progress vs expectations.\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Reflect on former goals and set new ones.\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Update compensation based on performance.\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Knowing what the point of the review is about will help all parties handle the conversation.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"⚖️ 3. Use a template\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Writing performance evaluations for a team of 10 individuals without formal structure can easily let unconscious bias creep in. Biases are human, and the nasty thing about unconscious bias is you don't even realise it's affecting your judgement. That is no joke when promotions, pay rises or performance improvement plans are on the line.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"A standard structure for all reviews will make them fairer. An added plus is that you will not start from a blank sheet of paper. You will also save time!\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Most large organisations have a common template, but it could be something like:\"\n    }), \"\\n\", _jsxs(_components.ol, {\n      children: [\"\\n\", _jsx(_components.li, {\n        children: \"Achievements.\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Areas for improvement.\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Goals: ideally to be filled in together.\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Overall: below/meets/above expectations.\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"🔮 4. Set clear expectations from the get-go\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Before you even give feedback to someone, you must be explicit about what you expect. Being told you are not meeting expectations when those expectations were not even made clear can be an incredibly frustrating experience and break all trust.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.em, {\n        children: \"Why didn't you tell me before?\"\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It is your responsibility to set clear expectations. You should routinely do this at multiple levels: individual, project and team. An effective way to ensure individual expectations are fair is to use an engineering-wide progression framework. Each level in the framework will have associated responsibilities and expected behaviours. When the framework is clear and transparent, everyone will trust performance evaluations are fair.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Creating a sound engineering career progression framework could well be an entire article series. In the meantime, you can check \", _jsx(_components.a, {\n        href: \"http://progression.fyi\",\n        children: _jsx(_components.code, {\n          children: \"progression.fyi\"\n        })\n      }), \" for inspiration.\"]\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"✍️ 5. Write everything down\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Do you want to put people's careers in the hands of your memory? Forgetting some team member's achievement is relatively easy and could very well be the difference between “\", _jsx(_components.em, {\n        children: \"meets”\"\n      }), \" and “\", _jsx(_components.em, {\n        children: \"exceeds”\"\n      }), \" expectations. Who knows, perhaps they should be getting a 20% raise but get 5% instead.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Write everything down and examine your notes for that particular individual when working on their evaluation. A convenient place to keep notes is your 1-1 doc with that person. If you don't want them to be able to read your raw notes, keep a separate individual doc that's private. Whatever works best for you, just write everything down. Not only will you give fairer evaluations, but you will also write them much faster!\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"🤗 6. Reflect on support\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We've talked a lot about expectations but haven't mentioned support until now. You probably want to have high expectations but also high levels of support.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Even when your expectations are clear and you give frequent feedback, your evaluation may still be unfair if an individual receives much less support than another. The consequences of having wildly different levels of support can be especially damaging when it comes to people from underrepresented backgrounds.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Observing differences in levels of support can be tricky, but you can look at a few things:\"\n    }), \"\\n\", _jsxs(_components.ul, {\n      children: [\"\\n\", _jsx(_components.li, {\n        children: \"Amount of time colleagues spend mentoring them or pairing together.\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Resources received for training.\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"The number of opportunities you send their way as their manager.\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Take time to observe and reflect on this periodically.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"🏁 7. Set and periodically monitor goals\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Performance reviews can be an excellent opportunity to reflect and set goals together for the next cycle and beyond. Goals that are jointly set result in higher levels of ownership by the individual.\"\n    }), \"\\n\", _jsxs(_components.ul, {\n      children: [\"\\n\", _jsx(_components.li, {\n        children: \"Master event-driven architecture.\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Champion a team-wide initiative that makes software delivery better.\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"Get promoted to senior engineer.\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Do not park these goals until the next review cycle. Instead, have them present and discuss them frequently during 1-1s. This will create accountability and many opportunities for feedback.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"🙌 Thanks for reading! Hopefully, these tips will help you deliver fairer reviews more easily. If you have additional ideas, please do send them my way.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","scope":{}},"series":null},"__N_SSG":true}