{"pageProps":{"metadata":{"path":"content/post/2011-09-24-london-here-we-go.mdx","title":"London, here we go!","date":"2011-09-24T13:28:24.000Z","categories":["General"],"series":null,"description":null,"slug":"london-here-we-go","readingTime":"2 min read","draft":false,"disableComments":false,"keywords":[],"banner":null},"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    img: \"img\",\n    p: \"p\",\n    a: \"a\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.img, {\n      src: \"/img/wp/kingstonuniversity.webp\",\n      alt: \"kingstonuniversity.jpg\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It's been a while since I wrote anything on the blog but hey, this time I have an excuse. I\\\"m in Kingston Upon Thames (London) to study computing science and games development for a whole year with an Erasmus exchange scholarship. I arrived on September the 13th and since then, it's been a nonstop of activities: tourism, paperwork, parties, meeting people, housework, etc. Finally I can sit for a while to write this.\"\n    }), \"\\n\", _jsx(_components.img, {\n      src: \"/img/wp/IMAG0210.webp\",\n      alt: \"IMAG0210.jpg\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [_jsx(_components.a, {\n        href: \"http://en.wikipedia.org/wiki/Kingston_upon_Thames\",\n        children: \"Kingston Upon Thames\"\n      }), \" is a little city in southwest London, the advantage of its reduced extension is that you can walk almost everywhere. However is also really close to Central London, if you catch a train (there's one each 15 minutes) you\\\"ll be in Waterloo station in about 20 minutes. So far I think it's a great combination. I live in a hall of residence, specifically in a flat shared with other 5 international students, such a great place to meet new people and party! My hall is 5 minutes walking from the center, which has a nice main street full of shops. Of course, I couldn't forget the pubs and clubs. Although they close extremely early, we always have a great time hanging out there. It's real fun when we gather to watch a football (soccer if you\\\"re American) game while drinking a pint!\"]\n    }), \"\\n\", _jsx(_components.img, {\n      src: \"/img/wp/IMAG0183.webp\",\n      alt: \"IMAG0183.jpg\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Computing science is taught at the main campus which is called Penrhyn Road, 15 minutes away if you walk. I was amazed with the huge amount of money they should invest to have proper facilities: a huge library, great fully equipped labs and comfortable classrooms. It's unbelievable how active the people is around here, there are students societies for almost everything you can imagine: DJs, skydiving, fencing, cake eating, wine tasting, gaming, market investment… And the list goes on!\"\n    }), \"\\n\", _jsx(_components.img, {\n      src: \"/img/wp/IMAG0235.webp\",\n      alt: \"IMAG0235.jpg\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I've chosen 4 modules in computing science and 4 in games development, so it's going to be some kind of mixture. I\\\"m very excited because the year looks really promising! I\\\"ll try to learn as much as possible not only in games development but in other skills such as English, speaking in public, teamwork, etc.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I\\\"ll keep you posted!\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","scope":{}},"series":null},"__N_SSG":true}