{"pageProps":{"metadata":{"path":"content/post/2013-01-06-will-they-steal-my-code.mdx","title":"Will they steal my code?","date":"2013-01-06T10:15:20.000Z","categories":["Games development"],"series":null,"description":null,"slug":"will-they-steal-my-code","readingTime":"5 min read","draft":false,"disableComments":false,"keywords":[]},"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    h3: \"h3\",\n    img: \"img\",\n    a: \"a\",\n    div: \"div\",\n    pre: \"pre\",\n    code: \"code\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"Creative people usually make a big deal out of authorship and honestly, who can blame us? We\\\"re passionate about our work! Producing something that doesn't entirely suck entails sweat, tears and numerous sleepless nights. The open source world is inherently tricky and raises many concerns regarding ownership.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Open source is a tradeoff\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The story of our lives isn't it? Making your project open source is a tradeoff. On one hand you are more likely to achieve certain level of exposure. You\\\"ll ask questions on StackOverflow, publish your progress under the showcase category of the engine you\\\"re using and chat with other devs on an IRC channel. Being active in a community where people share their love in source code shape is wonderful and enriching. Who knows? Maybe a prospective employer thinks your coding style is \\\"elegant\\\" after browsing your online repository. True story.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"On the other hand, it's understandable to fear hosting your code where it can be checked out by anyone and be claimed as theirs. Especially knowing they could shamelessly use it for commercial purposes even though your license explicitly forbids it. Horror stories where interviewers found out their candidates were presenting someone else's code as theirs are widely known. Yes, shame on them!\"\n    }), \"\\n\", _jsx(_components.img, {\n      src: \"/img/wp/show-me-the-source-yoda.jpg\",\n      alt: \"show-me-the-source-yoda.jpg\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Let's first assume your rent doesn't depend on people buying what you make. Unless you have an alternative business model such as providing an additional service, logic would slap you in the face. However, if this is something you\\\"re making to boost your portfolio or just for fun, read on and you\\\"ll find a few ways of making sure you keep the ownership of anything you publish, absent doubts.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"After taking some precautions, making open source software really pays off.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Attach the license\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"First of all, you must make clear which license your code sweetness is published under. A good practice is to attach an \", _jsx(_components.a, {\n        href: \"http://www.gnu.org/prep/maintain/html_node/Recording-Contributors.html\",\n        children: \"AUTHORS\"\n      }), \" along a LICENSE file in the main folder of the repo. Even though many people overlook this, every single file of code should contain a header summarizing that license. Shall we look at Sion Tower as an example of project published under \", _jsx(_components.a, {\n        href: \"http://gplv3.fsf.org/\",\n        children: \"GPL 3\"\n      }), \"? Here's its \", _jsx(_components.a, {\n        href: \"https://forja.rediris.es/plugins/scmsvn/viewcvs.php/siontower/trunk/src/LICENSE?root=cusl5-iberogre&view=markup\",\n        children: \"LICENSE\"\n      }), \" file and the beginning of the \", _jsx(_components.a, {\n        href: \"https://forja.rediris.es/plugins/scmsvn/viewcvs.php/siontower/trunk/src/include/collisionManager.h?root=cusl5-iberogre&rev=238&view=markup\",\n        children: \"CollisionManager.h\"\n      }), \" file.\"]\n    }), \"\\n\", _jsx(_components.div, {\n      className: \"remark-highlight\",\n      children: _jsx(_components.pre, {\n        className: \"language-unknown\",\n        children: _jsx(_components.code, {\n          className: \"language-unknown\",\n          children: \"/*\\n * This file is part of SionTower.\\n *\\n * \\n * David Saltares Marquez (C) 2011\\n * &lt;david.saltares@gmail.com&gt;\\n *\\n * \\n * SionTower examples are free software: you can redistribute it and/or\\n * modify it under the terms of the GNU General Public License ad\\n * published by the Free Software Foundation, either version 3 of the\\n * License, or (at your option) ant later version.\\n *\\n * SionTower examples are distributed in the hope that it will be useful,\\n * but WITHOUT ANY WARRANTY; without even the implied warranty of\\n * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the\\n * GNU General Public License for more details.\\n *\\n * You should have received a copy of the GNU General Public License\\n * along with SionTower examples.  If not, see &lt;http://www.gnu.org/licenses/&gt;.\\n */\"\n        })\n      })\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Obviously, you don't need to use GPL 3 necessarily, just make sure you attach the corresponding text of your license of choice.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"License? Check.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Some people couldn't care less about software licenses, fair enough. So… Shall we move on to the next point?\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Run away from Dropbox! Use a version control system\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Possibly, the most important golden rule of all is to keep track of your work's history. If you host your code in Dropbox and then share the link, you\\\"re doomed. The second someone asks for proof you've written it, you\\\"ll have to go home and cry. The answer is simple, use version control. To be honest, why the hell wouldn't you be doing that anyway  Let's put flame wars aside, SVN, Git, Mercurial or any other would be perfectly valid. Backups are built in, you can revert changes and what matters to us now, you get a full history of everything that's happened.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I know for a fact that employees check your projects\\\" history to prevent people stealing code from other sources without even knowing what they\\\"re doing. Being able to reuse and adapt code is excellent and it's highly appreciated, but you need to roughly understand what you\\\"re dealing with.\"\n    }), \"\\n\", _jsx(_components.img, {\n      src: \"/img/wp/i-have-no-idea-what-im-doing.jpg\",\n      alt: \"i-have-no-idea-what-im-doing.jpg\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Write a dev blog\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Finally, it\\\"d be a brilliant idea to write a development blog where you explain your progress. Not only it serves as a backup log, it's the ultimate proof you fully understand the details of the problem being tackled. Actually, it's beneficial for so many other reasons as it also reinforces the impact your project has in the community and increases your online presence. Key facts.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In my humble opinion, sharing your code can bring you happiness in form of acknowledgement, personal enrichment and, why not, professional success. You just need to be aware of the caveats and take reasonable precautions.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","scope":{}},"series":null},"__N_SSG":true}