{"pageProps":{"metadata":{"path":"content/post/2013-04-14-dont-be-a-dick-with-the-community.mdx","title":"Don't be a dick with the community","date":"2013-04-14T07:57:55.000Z","categories":["Computing","Games development"],"series":null,"description":null,"slug":"dont-be-a-dick-with-the-community","readingTime":"5 min read","draft":false,"disableComments":false,"keywords":[],"banner":null},"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    blockquote: \"blockquote\",\n    h3: \"h3\",\n    a: \"a\",\n    img: \"img\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"Open source is sometimes much more than just coding and committing to the most trendy repository at that point in time. It's also about the community. When a piece of software grows, stops being a pet project and makes a certain impact, it is to be expected to see people flocking around it. Who knows, even other developers could start contributing via pull requests, documentation or support in your forums.\"\n    }), \"\\n\", _jsxs(_components.blockquote, {\n      children: [\"\\n\", _jsx(_components.p, {\n        children: \"Awesome!\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Indeed, but…\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Well, sometimes projects can grow too much, its main developer may be trapped under a massive pile of work or simply doesn't feel like investing so much time in it anymore, which is fair enough. However, some authors adopt quite an aggressive approach when it comes to dealing with their community and that is not so okay.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Hostile communities\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Earlier this week a fellow programmer and countryman sent a \", _jsx(_components.a, {\n        href: \"https://github.com/gothfox/Tiny-Tiny-RSS/pull/142\",\n        children: \"pull request to Tiny Tiny RSS\"\n      }), \". Interestingly enough, that's the Google Reader alternative I talked about less than a month ago. Sadly, he was received with rude comments and a complete lack of appreciation for his efforts. Take a couple of minutes to read through the brief conversation and judge by yourself.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I don't want to get into the details of the pull request itself, but lets be over generous and assume my friend didn't approach the initial problem the best way possible. Regardless of the quality of the patch, there's no reason to drop all common courtesy except for, perhaps, enhancing, an already large ego.\"\n    }), \"\\n\", _jsx(_components.img, {\n      src: \"/img/wp/hostile-community.webp\",\n      alt: \"hostile-community-300x200.jpg\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Making this all about this particular case would be a bit ugly and, since there is a much obvious and better example, let's bring it up. Linus Torvalds and the Linux Kernel! There are countless \", _jsx(_components.a, {\n        href: \"https://lkml.org/lkml/2012/12/23/75\",\n        children: \"mailing list entries\"\n      }), \" with serious insults coming from the controversial programmer aimed at contributors, who, in most cases, are renowned professionals. Surely he is an incredibly busy man and his project is titanic. Nevertheless, excuse me for saying that not even such situation legitimises being a dick.\"]\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"It's really not that hard to be polite\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It goes without saying that a much better response for these situations be something like what follows.\"\n    }), \"\\n\", _jsxs(_components.blockquote, {\n      children: [\"\\n\", _jsx(_components.p, {\n        children: \"Thanks for the pull request! However, I believe X is not an optimal solution cause of Y. If you could rework it and update the commit later, that\\\"d be ace. Otherwise, we\\\"ll try to address the underlying issue as soon as possible.\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Even this is fine.\"\n    }), \"\\n\", _jsxs(_components.blockquote, {\n      children: [\"\\n\", _jsx(_components.p, {\n        children: \"Sorry it took so long to review this. I\\\"m sorry, I can't accept this patch because of Y. This topic has already been discussed in the forums, please query the search tool before tackling a problem in the future. I\\\"m too busy to fix this myself, feel free to try again.\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"See? That wasn't too hard, was it?\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Obviously, this guy, or anyone for that matter, can do whatever he pleases. The matter of whether his community would prosper under this environment or not, is a whole different story. I would imagine, a minority of them just don't give a monkey's. Ultimately, I guess some people are simply difficult to deal with. However, if you want to work in a community, I think it's good to be aware of good practises, generally common sense and politeness work.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Healthy communities\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Fortunately, there are plenty of cheerful and \", _jsx(_components.a, {\n        href: \"http://www.badlogicgames.com/wordpress/\",\n        children: \"healthy communities\"\n      }), \". Some more than others, but my point is that they exist. I can't say my experience with crowd powered open source development is great but I've been involved in a couple projects. As some of you may know, one of them is libgdx.\"]\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Libgdx's forums, IRC channel and Github repository are full of friendly folks. As opposed to the previous examples, I've never seen a poisonous comment nor an insult. Actually it's quite the opposite, for instance, all pull requests are nicely handled, even if they\\\"re incorrect. People are constantly posting \", _jsx(_components.a, {\n        href: \"http://www.badlogicgames.com/forum/viewforum.php?f=17&sid=89dac63d836a1962567e66dbd71488cc\",\n        children: \"extensions\"\n      }), \", \", _jsx(_components.a, {\n        href: \"http://www.badlogicgames.com/forum/viewforum.php?f=16&sid=89dac63d836a1962567e66dbd71488cc\",\n        children: \"showcasing\"\n      }), \" their work and the acid humor that floods the IRC is just brilliant.\"]\n    }), \"\\n\", _jsx(_components.img, {\n      src: \"/img/wp/beer.webp\",\n      alt: \"beer\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"That kind of atmosphere is truly splendid, as it encourages people to be more active. Ironically, the hazardous environment of hostile communities scare newcomers off because they think they\\\"d be attacked as soon as they participate. Sadly, their negativity gives the open source world its current reputation of being swarmed by nerds with gigantic egos.\"\n    }), \"\\n\", _jsxs(_components.blockquote, {\n      children: [\"\\n\", _jsx(_components.p, {\n        children: \"So what's the moral of this story?\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Don't be a grumpy person, don't be a dick, be nice to people. Also, on a side note, don't let an unhealthy community knock down your morale.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","scope":{}},"series":null},"__N_SSG":true}