{"pageProps":{"metadata":{"path":"content/post/2012-12-22-programming-books-personal-picks.mdx","title":"Programming books, personal picks","date":"2012-12-22T19:55:38.000Z","categories":["Computing","Games development"],"series":null,"description":null,"slug":"programming-books-personal-picks","readingTime":"4 min read","draft":false,"disableComments":false,"keywords":[],"banner":null},"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    em: \"em\",\n    h3: \"h3\",\n    img: \"img\"\n  }, _provideComponents(), props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsxs(_components.p, {\n      children: [\"A friend recently asked me about which either general or games specific programming books would I recommend. The true and legendary must read. I answered him directly as I was feeling lazy about posting a comment on each one of them but here I am now. Nevertheless, before going straight to the list, please bare in mind that just like any other best of [\", _jsx(_components.em, {\n        children: \"insert year here\"\n      }), \"] collection, this is simply a matter of opinion. Not every book is necessarily suitable for everyone at any given time.\"]\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Effective C++\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Provided you already know how to code in C/C++ reasonably well, this is the book you should be looking at. Proficiency is in the details and you want to get better, don't you? Structured in small pieces of advice, makes it highly entertaining and almost hides the complexity of the dense topics it covers. Contents range from subtle language details to design gems and wise use of OOP, it has a little bit of everything and I love it. The best non basic C++ book I have ever read, absent doubt.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"If you want to go further, \", _jsx(_components.em, {\n        children: \"More Effective C++\"\n      }), \" and \", _jsx(_components.em, {\n        children: \"Effective STL\"\n      }), \" are worth checking out as well.\"]\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Design Patterns\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I read this one a few years ago and it has proven itself most helpful since then. It is the classic patterns book, elegantly designed solutions to common problems. Singleton, facade, factory and all their friends are explained by presenting a real life problem, discussing a few alternatives to finally come up with a beautiful approach to solve it. Patterns are widely used in companies and, I believe knowing how to employ them wisely is paramount to be a good coder. As it is also an item structured book, it becomes quite accessible and allows being used as a consult source.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Game Engine Architecture\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Personally, I consider it the ultimate game programming Bible. Brilliantly written by a Naughty Dog coder, it goes through every single component a decent game engine has. Input, rendering, collision detection, AI, networking and many others are there. Not only it explains what every subsystem does and a few ways of implementing each one of them, it also details how subsystems cooperate to achieve the bigger goal. Even though it does not provide an excessive amount of sample code, it hints enough so a mere commoner coder like me can implement stuff and feel fairly smart afterwards.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"However, I would not recommend it as a first contact with game development, being so massive and detailed, it can blow any newcomer's mind.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Game Programming Gems\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"This one is actually a series of books, very well known if I may add so it will not strike you as a surprise. Each issue is made of several articles written by industry professionals on themed blocks. I read a few when I was a complete noob so my ability to absorb knowledge from them was quite limited to put it nicely. As opposed to Game Engine Architecture, which scratches the surface of many topics, these texts are highly specific and therefore, recommended for medium to advanced programmers. This is the real deal, profusely tested and used in tangible projects.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Artificial Intelligence for Games\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Want to learn about game AI? Search no more because this is it. Very few books start covering the very basics about an artificial intelligence system and end up explaining quite advanced stuff such as space partitioning, hierarchical path finding and machine learning. Even though it warms up with a friendly vision of how AI systems are designed and layered, it turns to be absolutely right and precise. Movement, physics, steering behaviors, state machines, high level strategies, decision making, you name it, the book explains it in plain English and easy to digest Python like pseudo-code.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I read it from cover to end only to find out later that it was going to be the course book for the AI module I took in Kingston University.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"Currently I am reading through \", _jsx(_components.em, {\n        children: \"Large Scale C++ Software Design\"\n      }), \" and it seems like a strong candidate for this list. I will probably write my impressions on it in the near future.\"]\n    }), \"\\n\", _jsx(_components.img, {\n      src: \"/img/wp/pending-books.jpeg\",\n      alt: \"pending-books.jpeg\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","scope":{}},"series":null},"__N_SSG":true}